OpenFOAM_Maincode/tutorials/incompressibleFluid/elipsekkLOmega/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.1 0 0);

boundaryField
{
    outlet
    {
       type             inletOutlet;
       inletValue       uniform (0 0 0);
       inlet            uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (3.1 0 0);
    }
    up
    {
        type            symmetry;
    }
    hole
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
